In [1]:
import numpy as np
import pandas as pd

In [2]:
movie = pd.read_csv('http://bit.ly/movieusers')

In [3]:
# its | sepeated so I need to add sep = '|'
movie.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [4]:
# adding |
movie = pd.read_csv('http://bit.ly/movieusers',sep = "|",header = None,names = ['userid','age','gender','occupation','zip_code'])
movie.head()

   userid  age gender  occupation zip_code
0       1   24      M  technician    85711
1       2   53      F       other    94043
2       3   23      M      writer    32067
3       4   24      M  technician    43537
4       5   33      F       other    15213

In [5]:
# want to know how many occupatins are there and its 21
movie.occupation.nunique()

21

In [6]:
movie.occupation.unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [7]:
movie.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
doctor             7
homemaker          7
Name: occupation, dtype: int64

In [8]:
# how many doctors are there
movie.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
doctor             7
homemaker          7
Name: occupation, dtype: int64

In [9]:
movie.columns

Index(['userid', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [10]:
# Male - 670 and Female-273
movie.gender.value_counts()

M    670
F    273
Name: gender, dtype: int64